<?xml version="1.0" encoding="UTF-8"?><!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><head>
<title>Como Crear/Editar/Borrar filtros</title>
<style type="text/css">
		/* Style for specific inline images */
		
		/* Style for specific ordered lists */
		
		/* Style for specific table cells */
</style>
<link type="text/css" href="/library/skin/tool_base.css" media="all" rel="stylesheet" />
<link type="text/css" href="/library/skin/default/tool.css" media="all" rel="stylesheet" />
</head>
<body>
<div class="helpBody">
<h2>Como Crear/Editar/Borrar p&aacute;ginas</h2>
	<p>En la p&aacute;gina que muestra el listado de p&aacute;ginas podemos hacer las acciones de crear, editar o borrar p&aacute;ginas.</p>
	<p>Para acceder debemos pulsar sobre la opci&oacute;n <i>P&aacute;ginas</i> en el men&uacute; superior.</p>

<h3>Crear un nueva p&aacute;gina</h3>
	<ol>
		<li>Pulsar sobre la opci&oacute;n <i>Nueva P&aacute;gina</i></li>
		<li>Ponerle un nombre a la p&aacute;gina (no puede coincidir con el nombre de otra p&aacute;gina, o con el identificador de una herramienta)</li>
		<li>Establecer la disposici&oacute;n, la p&aacute;gina puede tener sus herramientas en una columna o en dos columnas. Si la disposici&oacute;n estaba en dos columnas y cambias a una, las herramientas de la columna izquierda se a&ntilde;aden al final.</li>
		<li>Para a&ntilde;adir una nueva herramienta a la p&aacute;gina pulsamos sobre el men&uacute; desplegable donde aparecen todas las herramientas de Sakai, elegimos la que deseamos a&ntilde;adir y pulsamos en el icono de de la cruz verde, el cual nos inserta dicha herramienta al final de la primera (o &uacute;nica) columna.</li>
		<li>Una vez a&ntilde;adida la herramienta, podemos reordenarlas a nuestro gusto arrastrando su nombre hacia otra columna, o hacia otra posici&oacute;n dentro de la misma columna.</li>
		<li>Con la opci&oacute;n <i>Guardar</i>, guardamos la p&aacute;gina.</li>
	</ol>

<h3>Editar una p&aacute;gina</h3>
<p>El icono (l&aacute;piz) que aparece en la primera columna de la lista de p&aacute;ginas es para editarlas.</p>
<p>Tenga en cuenta que las p&aacute;ginas que se modifiquen afectar&aacute;n a las tareas ya creadas que lo usen.</p>

<h3>Eliminar una p&aacute;gina</h3>
<p>El icono (aspa roja) que aparece en la segunda columna de la lista de p&aacute;ginas es para eliminarlas.</p>
<p>Tenga en cuenta que las p&aacute;ginas que se eliminen tambi&eacute;n ser&aacute;n eliminadas de aquellas tareas que la est&eacute;n usando.</p>

</div>
</body></html>
